

export const PowerInfo = () => {
    return (
        <>
            <h3>מהו יפוי כח מתמשך?</h3>
            <p>
            יפוי כח מתמשך הוא מסמך משפטי שבו אדם (הממנה) מסמיך אדם אחר (המוסמך) לפעול בשמו
            במקרים מסוימים ותחת תנאים מסוימים, לרוב כאשר הוא לא יוכל לטפל בענייניו בעצמו, לדוגמה
            בשל ירידה בכושר הנפשי ו/או הגופני.
                        </p>
                        <br />
                        <h3>הבדל בין יפוי כח רגיל ליפוי כח מתמשך</h3>
                        <p>יפוי כח רגיל: ס&#39; 14(א) לחוק השליחות, תשכ&quot;ה-1965 קובע כי יפוי כח רגיל תקף כל עוד הממנה
            בעל כושר פעולה משפטי. הוא מתבטל ברגע שהממנה אינו יכול עוד להביע רצון משפטי באופן תקין
            (למשל, בשל דמנציה).
            - יפוי כח מתמשך: נועד להיכנס לתוקף דווקא כאשר הממנה אינו יכול עוד להביע רצון משפטי
            ומאפשר למוסמך לנהל את ענייניו של הממנה, בפרט במצבים אלו.
            </p>
            <br />
            <h3>מטרות המסמך</h3>
            <ul>
                <li>שמירה על רצון הממנה: המסמך מאפשר לממנה לקבוע מראש מי יטפל בענייניו וכיצד, במקרה
שלא יהיה מסוגל לכך בעצמו.</li>
                <li>
                יפוי הכח מספק מסגרת משפטית שתומכת בפעולות המוסמך, ומבטיחה כי הוא
יכול לפעול לטובת הממנה באופן חוקי ומקובל.
<br />
יפוי כח מתמשך הוא כלי משפטי חשוב שמאפשר לאנשים לשמור על שליטה על חייהם ורכושם
במקרה של אובדן כושר התפקוד. הוא מבטיח כי ההחלטות שיתקבלו בשמם יהיו על פי רצונם
ובהתאם להוראות שקבעו מראש, וכך מסייע בשמירה על כבודם ואוטונומיה אף בתקופות מורכבות.
                </li>
            </ul>

        </>
    )
}

export const ServiceTypeInfoDictionary = {
    FAMILY: '',
    DAMAGE: '',
    POWER: <PowerInfo />,
    GROUND: ''
}