

export const PowerInfo = () => {
    return (
        <>
            <h3>מהו יפוי כח מתמשך?</h3>
            <p>
            יפוי כח מתמשך הוא מסמך משפטי שבו אדם (הממנה) מסמיך אדם אחר (המוסמך) לפעול בשמו
            במקרים מסוימים ותחת תנאים מסוימים, לרוב כאשר הוא לא יוכל לטפל בענייניו בעצמו, לדוגמה
            בשל ירידה בכושר הנפשי ו/או הגופני.
                        </p>
                        <br />
                        <h3>הבדל בין יפוי כח רגיל ליפוי כח מתמשך</h3>
                        <p>יפוי כח רגיל: ס&#39; 14(א) לחוק השליחות, תשכ&quot;ה-1965 קובע כי יפוי כח רגיל תקף כל עוד הממנה
            בעל כושר פעולה משפטי. הוא מתבטל ברגע שהממנה אינו יכול עוד להביע רצון משפטי באופן תקין
            (למשל, בשל דמנציה).
            - יפוי כח מתמשך: נועד להיכנס לתוקף דווקא כאשר הממנה אינו יכול עוד להביע רצון משפטי
            ומאפשר למוסמך לנהל את ענייניו של הממנה, בפרט במצבים אלו.
            </p>
            <br />
            <h3>מטרות המסמך</h3>
            <ul>
                <li>שמירה על רצון הממנה: המסמך מאפשר לממנה לקבוע מראש מי יטפל בענייניו וכיצד, במקרה
שלא יהיה מסוגל לכך בעצמו.</li>
                <li>
                יפוי הכח מספק מסגרת משפטית שתומכת בפעולות המוסמך, ומבטיחה כי הוא
יכול לפעול לטובת הממנה באופן חוקי ומקובל.
<br />
יפוי כח מתמשך הוא כלי משפטי חשוב שמאפשר לאנשים לשמור על שליטה על חייהם ורכושם
במקרה של אובדן כושר התפקוד. הוא מבטיח כי ההחלטות שיתקבלו בשמם יהיו על פי רצונם
ובהתאם להוראות שקבעו מראש, וכך מסייע בשמירה על כבודם ואוטונומיה אף בתקופות מורכבות.
                </li>
            </ul>

        </>
    )
}

export const Family = () => {
    return (
        <>
            <h3>מהו מושג &quot;ידועים בציבור&quot;?</h3>
            <p>
            &quot;ידועים בציבור&quot; הוא מונח המתייחס לזוגות שחיים יחד במערכת זוגית קבועה וארוכת טווח, מבלי
להתחתן רשמית לפי החוק. המונח משקף את הכרה חברתית ומשפטית בזוגיות זו כקיימת ובעלת
חשיבות, גם בלי קיום טקס נישואין רשמי או חוזה נישואין מסורתי.
            </p>
            <br/>
            <h3>מהו הסכם גירושין?</h3>
    
            <p>
            הסכם גירושין הוא מסמך משפטי המפורט את הסדרים וההסכמות בין בני זוג המתגרשים. ההסכם
כולל הסדרים בנוגע לנושאים כמו חלוקת רכוש, מזונות, משמורת על הילדים, זכויות ביקור ועוד.
מטרת ההסכם היא לסדר את הפרידה באופן שיתאים לשני הצדדים תוך מניעת סכסוכים עתידיים.
            </p>
            <br/>
            <h3>מהו הסכם ממון?</h3>
            <p>
            הסכם ממון הוא מסמך משפטי בו בני זוג (נשואים או בדרך לנישואים) מסדירים ביניהם את
חלוקת הרכוש והכלכלה המשותפת, לפני או לאחר הנישואין. הסכם זה כולל הוראות לגבי
חלוקת הרכוש במקרה של פירוק הזוגיות, ולעיתים גם הסדרים נוספים כגון מזונות, משמורת
ילדים ועוד. המטרה היא ליצור בהירות והסכמה מראש לגבי נושאים אלו, כדי למנוע סכסוכים
ולהקל על תהליך הפרידה, אם יתרחש.
            </p>
        </>
    )
}

export const Ground = () => {
    return (
        <>
            <p>
            עורך דין המייצג רוכש/מוכר בעסקת מקרקעין צריך לבצע סדרה של בדיקות קפדניות לפני החתימה
על הסכם המכר המחייב, כדי להבטיח את האינטרסים של הלקוח ולמנוע בעיות עתידיות. הנה
רשימה של הבדיקות העיקריות:
            </p>
            <br />
            <h3>בדיקת בעלות הנכס:</h3>
            <p>
            יש לוודא שהמוכר הוא בעל הזכויות המלאות על הנכס ושאין מחלוקת או
טענות של צדדים שלישיים.
            </p>
            <br />
            <h3></h3>
            <p></p>
            <br />
            <h3></h3>
            <p></p>
            <br />
        </>
    )
}

export const ServiceTypeInfoDictionary = {
    FAMILY: <Family />,
    DAMAGE: '',
    POWER: <PowerInfo />,
    GROUND: <Ground />
}