import './style.scss';

export const ClientRecommend = () => {
    return (
        <div className="client-recommend" id="client-recommend-section">
            <div className="section-header">לקוחות ממליצים</div>

            <div className="client-recommend-wrapper">
                <div className="client-recommend-item">
                    <div className="client-recommendation">
                      "  יפית שלום
                        שהחלטתי שאני חייבת לקום ולעזוב את הבית שלי ,לא ידעתי מהן  הזכיות שלי   , לא תיארתי לעצמי שיש לי את הכוחות לבצע את התהליך שניקרא גירושים והייתי מבולבלת . ופה הגיעו הצמד המנצח יפית וגל נהרי הם היו זמינים תמיד לכל שאלה.תמיד היו לי כאוזן קשבת .ובעיקר נתנו לי תקווה שהכל יהיה בסדר שאין לי מה לדאוג מבחינה כלכלית , ובעיקר לזכיות של הילדים שלי .
                        ניתנו החלטות טובות בטיפולם המסור , ובסיועם הגענו להסכמות ברוח טובה ולסיום ההליכים בצורה טובה.
                        תודה רבה, מאלינור."
                    </div>
                </div>
                <div className="client-recommend-item">
                    <div className="client-recommendation">
"                        ענבר היקרה ,תודה על הייצוג בעסקת מקרקעין מורכבת, אין ספק שאת האדם המתאים ליצוג בעסקאות מקרקעין.בזכותך החוזה מול החברה הקבלנית שופר , טיפלת במקצועיות במו"מ וגם ברישום ובסוגית המיסוי. בברכה,בניאל י'. פתח תקווה
"                    </div>
                </div>
                <div className="client-recommend-item">
                    <div className="client-recommendation">
                       " יפית היקרה
                        שמעתי את ההודעה המשמחת
                        אכן , נעשה פה צדק איתי
                        אני מודה לך שהייתם השליחים שלי , תודה רבה על הכל."
                    </div>
                </div>
                <div className="client-recommend-item">
                    <div className="client-recommendation">
"                        נבר היקרה , תודה על המיומנות והמקצועיות ביצוג בעסקאות מכר של קניה ומכירה שביצעת עבורנו.יצגת אותנו ביסודיות,מסירות ומקצועיות אין קץ,פתרת לנו בעיות סבוכות בסוגיית המיסוי.מקווים שנהנת מהמתנה הצנועה ששלחנו לך ,את ראויה להרבה יותר מזה .תודה רבה,עדנה ויוסי יצחק.
"                    </div>
                </div>
                <div className="client-recommend-item">
                    <div className="client-recommendation">
                      "  יפית,
                        ברצוננו להודות לך מקרב הלב על הנכונות, האכפתיות והעזרה הרבה שנתת לנו ולמשפחתנו במשך תקופה ארוכה.
                        היית קשובה לבעיותינו וגילית מעורבות בנושא רגיש וכאוב ובכל עת שפנינו אליך לבקשת עצה ועזרה התפנית לענות לנו, לייעץ ולעזור, בסבלנות, ברגישות ובמקצועיות, דבר שהקל עלינו מאוד ביודענו שתעשי כל שביכולתך על מנת למצוא דרך לפתור את הבעיה הקשה בה היינו.
                        את כל זאת נזכור בעתיד ונשמח להמליץ עליך בפני כל אחד שיהיה בצרה או מצוקה ויזדקק לעזרתך המקצועית והאישית.
                        בתודה ובכבוד רב,
                        משפחת שמואלי"
                    </div>
                </div>
                <div className="client-recommend-item">
                    <div className="client-recommendation">
                       " לענבר עורכת הדין המקסימה,🌹❤
                        תודה לך על העזרה
                        תודה על המקצועיות שלך בתור עורכת דין והידע המשפטי,
                        ובכך פתרת לי בעיה עם לקוח קשה,
                        תודה לך על יחס חם אכפתיות ואדיבות מכל הלב בכל זמן ושעה,
                        אין עליך תודה לך ❤
                        מעריכה מאוד  מלי, ראש העין."
                    </div>
                </div>
            </div>
        </div>
    )
}