import {useState} from 'react';
import RightArrow from '../../assets/icons/right-arrow.png';
import LeftArrow from '../../assets/icons/left-arrow.png';
import './style.scss';

const articles = [
    {
        date: 'ינואר 2020',
        content: 'ענבר תודה לך שאת שליחה כל כך כל כך טובה ונאמנה שהשם ישמח אותך יקרה שלי. את מדהימהההה!!! הפתעת אותי וריגשת אותי ושימחת אותי לאורך כל התקופה הזו!!! תודה רבה על הכל אני מתרגשת בשביל אבא שלי כמו ילד שעושה צעד לראשונה בחייו...באמת!'
    },
    {
        date: 'דצמבר 2021',
        content: 'הגעתי לענבר בתקופה לא קלה שאיבדנו אחותי ואני את אבינו, עם קשיים מול משפחה ענבר היתה מקצועית, הוגנת ושם לתמוך לאורך כל התהליך, תודה רבה, יישר כוח.'
    },
    {
        date: 'אוקטובר 2023',
        content: 'לענבר עורכת הדין המקסימה, תודה לך על העזרה תודה על המקצועיות שלך בתור עורכת דין והידע המשפטי, ובכך פתרת לי בעיה עם לקוח קשה, תודה לך על יחס חם אכפתיות ואדיבות מכל הלב בכל זמן ושעה, אין עליך תודה לך  מעריכה מאוד.'
    },
    {
        date: 'ינואר 2022',
        content: 'ענבר היקרה, תודה על המיומנות והמקצועיות ביצוג בעסקאות מכר של קניה ומכירה שביצעת עבורנו. יצגת אותנו ביסודיות, מסירות ומקצועיות אין קץ, פתרת לנו בעיות סבוכות בסוגיית המיסוי. מקווים שנהנת מהמתנה הצנועה ששלחנו לך ,את ראויה להרבה יותר מזה.'
    },
    {
        date: 'דצמבר 2023',
        content: 'ברצוני להודות מקרב לב בשמי ובשם ילדיי על הטיפול יוצא הדופן לטובה בתיק שנלקחו ילדיי והמאמצים להחזרתם. טיפלתם בתיק במקצועיות וביעילות מרשימה והצלחתם להשיג בעבורי את המיטב האפשרי בכל הסוגיה . ישר כח! הגעתי אליכם לפני 5 שנים שנלקחו ממני ילדי בצו ביניים ומהר מאוד פעלתם בתיק יום ולילה כדי להשיג תוצאות, ותוך 6 חודשים של ריצות הגענו לתוצאה שילדיי הוחזרו לחזקתי למשמורת שלי. בזכותכם כיום הם איתי ובמשמורת שלי. ידעתי שיש לי גב ואני יכולה לסמוך שתעשו עבורי ועבור ילדיי ככל הניתן. תמיד יצאתי ממשרדכם עם חיוך ובתקווה שיהיה בסדר ואין זה מובן מאליו. תמיכתכם עזרה לי להמשיך בחיי שכן השילוב הקיים בכם של אנושיות וחריפות משפטי ללא פשרות ,הן שהעניקו לי בטחון ויכולת לקבל אף החלטות קשות מתוך ידיעה ברורה שדרככם היא הנכונה ביותר.'
    },
    {
        date: 'יולי 2013',
        content:'ברצוני להודות לך על הטיפול המסור והמקצועי שהגשתם לי, על הליויי הרגשי,על ההקשבה, על הניווט והמיקוד בעיניננו. פניצי אלייך כדי שתיעצי לי בעניין "הכרה כידועה בציבור" והופתעתי מהידע הנרחב והנסיון שלך בנושא זה. יצגת אותי במקצועיות ובהרבה הבנה הן למצבי והן בנושא רגשי ומורכב ויותר מכל על הסיום הטוב של ההליך שלי!!! בהצלחה וכה לחי!!'
    },
    {
        date: 'ינואר 2024',
        content:'שהחלטתי שאני חייבת לקום ולעזוב את הבית שלי ,לא ידעתי מהן  הזכיות שלי, לא תיארתי לעצמי שיש לי את הכוחות לבצע את התהליך שניקרא גירושים והייתי מבולבלת . ופה הגיעו הצמד המנצח יפית וגל נהרי הם היו זמינים תמיד לכל שאלה.תמיד היו לי כאוזן קשבת .ובעיקר נתנו לי תקווה שהכל יהיה בסדר שאין לי מה לדאוג מבחינה כלכלית, ובעיקר לזכיות של הילדים שלי. ניתנו החלטות טובות בטיפולם המסור, ובסיועם הגענו להסכמות ברוח טובה ולסיום ההליכים בצורה טובה.'
    },
    {
        date: 'אוקטובר 2011',
        content:'יפית, אני מכירה אותך מזה זמן רב. את אשה ישרה ונעימת הליכות. במרוצת שנות הכרותנו סייעת למספר רב של נשות מרכז "אמיגוס רמת גן", בנושאים רבים, ניחנת בהבנה מקצועית, חריצות ומסירות. הינך מייעצת לנו באופן שוטף, במקצועיות רבה, בענייני משפחה ורווחה, וכן מדריכה ומייצגת בבתי המשפט השונים, הן לחברים מר"ג והן לחברים מכל הארץ. הריני להביע תודה על היעוץ העזרה והתמיכה שלך במשפחות חד הוריות במרכז "אמיגוס רמת גן". בזכות אנשים כמוך כולנו נראים טוב יותר. יישר כח על נתינתך הענקית. המשיכי כך בעתיד.'
    },
    {
        date: 'אוקטובר 2011',
        content:'יפית, אני מכירה אותך מזה זמן רב. את אשה ישרה ונעימת הליכות. במרוצת שנות הכרותנו סייעת למספר רב של נשות מרכז "אמיגוס רמת גן", בנושאים רבים, ניחנת בהבנה מקצועית, חריצות ומסירות. הינך מייעצת לנו באופן שוטף, במקצועיות רבה, בענייני משפחה ורווחה, וכן מדריכה ומייצגת בבתי המשפט השונים, הן לחברים מר"ג והן לחברים מכל הארץ. הריני להביע תודה על היעוץ העזרה והתמיכה שלך במשפחות חד הוריות במרכז "אמיגוס רמת גן". בזכות אנשים כמוך כולנו נראים טוב יותר. יישר כח על נתינתך הענקית. המשיכי כך בעתיד. יפית יקירתי, רציתי להודות לך בראש ובראשונה על האדם שבך, על האישיות שלך ורק אח"כ על המקצועיות, הפדנטיות שלך והאכפתיות. יקירתי, את הסיפור שלי לא קל להבין ללא רגש ועם הלב הגדול שלך הצלחת להכיל את הסיפור ולתת פתרונות משפטיים שתמיד היו נכונים עבורי ובעבור הילדים שלי והאבא שלהם. אני חייבת לציין שפשוט קל ונוח לעבוד איתך, תמיד זמינה עבור כולנו, תמיד מוצאת פתרונות יצירתיים לכל בעיה וצרה, תמיד יש לך תשובות שהן גם מתוך תובנה רגשית וגם מתוך דאגה לשלומי ולשלום ילדיי ואביהם. לא האמנתי שאוכל למצוא עו"ד שלא יצא איתי למלחמה אלא שיבין שאני מחפשת שלום וכשמצאתי אותך כמו אוצר הבנת בדיוק את כוונתי והלכת איתי לדרכי שלום לצד שמירה על בטחוני ובטחון הילדים מתוך תובנה ורגישות למצב המורכב בו האבא של הילדים נמצא. יקירתי הלוואי והיו עוד המון כמוך שלפני המלחמה מחפשים את הדרך לשלום, לפני פירוק משפחה מחפשים את הדרך לאחד משפחה למרות שהמורכבות אצלנו לא פשוטה. בעייני את קודם כל אדם מדהים עם רגישות ותובנה ולאחר מכן ועו"ד מקצועית ועניינית. תודה רבה על העזרה, ההבנה, הליווי וההדרכה, על פתרונות מידיים זמינות בכל שעה ויכולת להבחין גם במצב הרגשי של כל המעורבים בדבר. אשמח לדבר עם כל אדם אשר יש לו הרהורים לגבי השירות והיחס שאת נותנת ולגבי המקצועיות שלך ושבך! ושוב... תודה רבה.'
    },
    {
        date: 'פבואר 2024',
        content:'יפית ליוותה אותי לאורך זמן מאוד ממשוך שערך כ 10 שנים יפית הייתה הרבה יותר מעורכת דין , אוזן קשבת ותמיכה בכל שעות היום. יפית הביאה אותי לניצחון על קבלת משמורת משותפת בערעור למחוזי ולאחר כמה שנים להפחתת מזונות משמעותית מאוד בבית משפט השלום. יפית תמיד הייתה עם נכונות לעזרה ונכונות להקשיב לרצון הלקוח ליווי צמוד לארוך כל תקופת הדיונים והתחשבות למצב הכלכלי הלא פשוט בתקופת הגרושים.'
    }
];

const ArticleSlideShow = () => {
    const [currentSlide, setCurrentSlide] = useState(0);

    // useEffect(() => {
    //     const timer = setTimeout(() => {
    //         setCurrentSlide((prevSlide) =>
    //             prevSlide === articles.length - 1 ? 0 : prevSlide + 1
    //         );
    //     }, 5000);

    //     return () => clearTimeout(timer);
    // }, [currentSlide]);

    const goToSlide = (index) => {
        setCurrentSlide(index);
    };

    const onArrowClick = (side) => {
        if (side === 'right') {
            setCurrentSlide((prevSlide) =>
            prevSlide === 0 ? articles.length - 1 : prevSlide - 1
        );
        }
        if (side === 'left') {
            setCurrentSlide((prevSlide) =>
                prevSlide === articles.length - 1 ? 0 : prevSlide + 1
            );
        }
    }

    return (
        <div className="clients-letters-slideshow" id="clients-letters-slideshow">
            <div className="section-header">לקוחות ממליצים</div>

            <div className="slideshow-container">
                    <div className="articles-wrapper">
                        {articles.map((article, index) => (
                            <div
                                key={index}
                                className={`slide fade ${index === currentSlide ? 'show' : ''}`}
                            >
                                <div className="article-content">
                                    <p className="article-p">{article.content}</p>
                                    <span className="article-title">{article.date}</span>
                                </div>
                            </div>
                        ))}
                    </div>
                <div className="arrow-container">
                    <div className="arrow a-right" onClick={() => onArrowClick('right')}><img src={RightArrow}/></div>
                    <div className="arrow a-left" onClick={() => onArrowClick('left')}><img src={LeftArrow}/></div>
                </div>
                <div className="dot-container">
                    {articles.map((_, index) => (
                        <span
                            key={index}
                            className={`dot ${index === currentSlide ? 'active' : ''}`}
                            onClick={() => goToSlide(index)}
                        ></span>
                    ))}
                </div>
            </div>
        </div>
    );
};

export default ArticleSlideShow;
